# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

l = ['Да', 1, 34.5, None]
print(l)

for elem in l:
    elem = type(elem)
    print(elem)

# Сложно сочетать новогодние праздники и домашку.
# Но сегодня обязательно в ночи допишу все остальные задания.